Web Services/1. Webservice Testing/Transactions/getShipments/Test Case 4/WS_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tran="http://www.hmco.com/EAI/OTS/Transaction">
   <soapenv:Header/>
   <soapenv:Body>
      <tran:shipmentIDList>
         <!--1 or more repetitions:-->
         <tran:transactionID>5741466</tran:transactionID>
      </tran:shipmentIDList>
   </soapenv:Body>
</soapenv:Envelope>